## CREATE CONNECTION

In [1]:
#mysql connector for creating connection
import mysql.connector

In [8]:

# Connecting from the server
database = mysql.connector.connect(user = 'root',
                               host = 'localhost',
                              passwd = 'Tharif786')

## Create Cursor Object

In [9]:

# Preparing a cursor object
cursor_object = database.cursor()

## Check For Databases

In [46]:
#check for databases
cursor_object.execute("SHOW DATABASES")

#retrive all rows 
databases = cursor_object.fetchall()

#printing all database names
for database_name in databases:
    print(database_name)

('information_schema',)
('library_management_system',)
('mysql',)
('performance_schema',)
('sys',)
('testdb',)

# DATA DEFINITION LANGUAGE

#### Creating Databases

In [57]:
#creating a Database
cursor_object.execute("CREATE DATABASE CompanyDatabase")

cursor_object.execute("SHOW DATABASES")

databases = cursor_object.fetchall()

for database_name in databases:
    print(database_name)

('companydatabase',)
('information_schema',)
('library_management_system',)
('mysql',)
('performance_schema',)
('sys',)
('testdb',)

#### Creating tables and defining Schema with Constraints

In [10]:
cursor_object.execute("USE CompanyDatabase")

In [64]:
cursor_object.execute(  """CREATE TABLE Employees ( 
                                                    EmployeeID INT PRIMARY KEY ,
                                                    FirstNAME VARCHAR(50) NOT NULL,
                                                    LastName VARCHAR(50),
                                                    DepartmentID INT NOT NULL,
                                                    HireDate DATE,
                                                    Salary Decimal(10,2) NOT NULL,
                                                    ActiveStatus BOOLEAN DEFAULT TRUE
                                                  )"""
                     )

In [65]:
cursor_object.execute( """ CREATE TABLE Departments (
                                                        DepartmentID INT PRIMARY KEY,
                                                        DepartmentName VARCHAR(50) UNIQUE  
                                                    )"""
    
                      )

In [66]:
cursor_object.execute( """  CREATE TABLE Projects ( 
                                                    ProjectID INT PRIMARY KEY,
                                                    ProjectName VARCHAR(50) NOT NULL ,
                                                    StartDate DATE NOT NULL,
                                                    EndDate DATE DEFAULT NULL,
                                                    Status VARCHAR(20) DEFAULT 'ONGOING'
                                                    )""" 
                        )

In [67]:
cursor_object.execute( """ CREATE TABLE EmployeeProjects (
                                                        EmployeeID INT REFERENCES Employees(EmployeeID),
                                                        ProjectID INT REFERENCES Projects(ProjectID),
                                                        Role VARCHAR(50)
                                                        )"""       
                     )

In [68]:
cursor_object.execute("SHOW TABLES")

tables = cursor_object.fetchall()

for table_name in tables:
    print(table_name)

('departments',)
('employeeprojects',)
('employees',)
('projects',)

In [94]:
#describing table
cursor_object.execute("desc departments")

#cursor_object.execute("desc Employees")
table_description = cursor_object.fetchall()

# Print the column names 
for column_name in table_description:
    print(column_name[0])

DepartmentID
DepartmentName

In [91]:
database.commit()

#### Alter table and renaming

In [95]:
#adding column in the table
cursor_object.execute("ALTER TABLE Employees ADD COLUMN EMAIL VARCHAR(50) ")

In [8]:
cursor_object.execute("desc Employees")

table_description = cursor_object.fetchall()

# Print the column names 
for column_name in table_description:
    print(column_name[0])

EmployeeID
FirstName
LastName
DepartmentID
HireDate
Salary
ActiveStatus
EMAIL

In [10]:
#RENAMING THE COLUMN
cursor_object.execute("ALTER TABLE Employees RENAME COLUMN FirstNAME TO FirstName ")

EmployeeID
FirstName
LastName
DepartmentID
HireDate
Salary
ActiveStatus
EMAIL

In [12]:
#MODIFYING THE DATA TYPE OF A COLUMN
cursor_object.execute("ALTER TABLE Employees MODIFY EMAIL VARCHAR(60) ")


cursor_object.execute("desc Employees")
table_description = cursor_object.fetchall()

# Print the column names 
for column_name in table_description:
    print(column_name)

('EmployeeID', 'int', 'NO', 'PRI', None, '')
('FirstName', 'varchar(50)', 'NO', '', None, '')
('LastName', 'varchar(50)', 'YES', '', None, '')
('DepartmentID', 'int', 'NO', '', None, '')
('HireDate', 'date', 'YES', '', None, '')
('Salary', 'decimal(10,2)', 'NO', '', None, '')
('ActiveStatus', 'tinyint(1)', 'YES', '', '1', '')
('EMAIL', 'varchar(60)', 'YES', '', None, '')

In [13]:
database.commit()

# DATA MANIPULATION LANGUAGE

#### Inserting Records in the database tables

## INSERT

In [19]:
cursor_object.execute("INSERT INTO Departments VALUES(101,'IT')")

In [20]:
cursor_object.execute("INSERT INTO Departments VALUES(102,'HR')")

In [21]:
cursor_object.execute("INSERT INTO Departments VALUES(103,'Finance')")

In [22]:
cursor_object.execute("INSERT INTO Departments VALUES(104,'Technical')")

In [23]:
cursor_object.execute("INSERT INTO Departments VALUES(105,'Marketing')")

In [11]:
cursor_object.execute("SELECT * FROM DEPARTMENTS")

rows = cursor_object.fetchall()

for attributes in rows:
    print(attributes)

(103, 'Finance')
(102, 'HR')
(101, 'IT')
(105, 'Marketing')
(104, 'Technical')

#### EmployeeProject Table

In [15]:
id=[1,2,3,4,5]
pid=[201,202,203,204,205]
Role=['Manager','Developer','Tester','Analyst','Consultant']

for i in range(0,len(pid)):
    cursor_object.execute(f"INSERT INTO EmployeeProjects VALUES({id[i]},{pid[i]},'{Role[i]}')")

In [17]:
cursor_object.execute("SELECT * FROM EmployeeProjects")

rows = cursor_object.fetchall()

for attributes in rows:
    print(attributes)

(1, 201, 'Manager')
(2, 202, 'Developer')
(3, 203, 'Tester')
(4, 204, 'Analyst')
(5, 205, 'Consultant')

In [18]:
database.commit()

## UPDATE

#### DELETE

#### SELECT

#### TRUNCATE